Autodesk.Navisworks.Api.DocumentParts.DocumentAlignments
Stores the Civil Alignment information contained in a Document.

Autodesk.Navisworks.Api.DocumentParts.DocumentAlignments.ActiveAlignmentIndex
The index of the alignment, from the provided list, that is the current alignment used for
rendering and everything else.

Autodesk.Navisworks.Api.DocumentParts.DocumentAlignments.Any
Are there any alignments in the scene

Autodesk.Navisworks.Api.DocumentParts.DocumentAlignments.Enabled
Is rendering of the current alignment enabled

Autodesk.Navisworks.Api.DocumentParts.DocumentAlignments.GetAlignments
Get a list of all of the alignments in the scene